10/data/attachments/72072c94f5f4ddbd.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_bd8adb16-4a75-4703-bb95-923bcd3b443a</nif:username>
            <nif:friendToBeAdded>Joseph_method_Friend_87061_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>